#9
# а.) Створення початкового списку
my_list = [1, 2, 3, 4, 5]

# Розширення списку
my_list.extend([3, 6, 7])
print("а.) Список після розширення:", my_list)

# б.) Вставка значення 33333 на другий елемент
my_list.insert(1, 33333)
print("б.) Список після вставки значення 33333:", my_list)

# в.) Розташування списку у зворотньому порядку
my_list.reverse()
print("в.) Список у зворотньому порядку:", my_list)

# г.) Додавання 3 в кінець списку
my_list.append(3)
print("г.) Список після додавання 3 в кінець:", my_list)

# д.) Видалення першого елементу зі значенням 3
if 3 in my_list:
    my_list.remove(3)
print("д.) Список після видалення першого елементу зі значенням 3:", my_list)

# е.) Сортування списку у порядку збільшення
my_list.sort()
print("е.) Список у порядку збільшення:", my_list)

# ж.) Очищення списку
my_list.clear()
print("ж.) Порожній список:", my_list)